; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_21_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 c19 c20 - counter
	)
  (:init
		(= (value c0) 33)
	(= (value c1) 87)
	(= (value c2) 9)
	(= (value c3) 62)
	(= (value c4) 7)
	(= (value c5) 38)
	(= (value c6) 95)
	(= (value c7) 9)
	(= (value c8) 59)
	(= (value c9) 29)
	(= (value c10) 75)
	(= (value c11) 46)
	(= (value c12) 83)
	(= (value c13) 40)
	(= (value c14) 16)
	(= (value c15) 28)
	(= (value c16) 54)
	(= (value c17) 19)
	(= (value c18) 59)
	(= (value c19) 78)
	(= (value c20) 47)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)
	(= (rate_value c17) 0)
	(= (rate_value c18) 0)
	(= (rate_value c19) 0)
	(= (rate_value c20) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
	(<= (+ (value c16) 1) (value c17))
	(<= (+ (value c17) 1) (value c18))
	(<= (+ (value c18) 1) (value c19))
	(<= (+ (value c19) 1) (value c20))
		)
	)
)

; plan
1. (increase_rate c17)
   changed: (rate_value c17) from 0 to 1
   goals met: 11 of 20
2. (increase_rate c17)
   changed: (rate_value c17) from 1 to 2
   goals met: 11 of 20
3. (increase_rate c17)
   changed: (rate_value c17) from 2 to 3
   goals met: 11 of 20
4. (increase_rate c17)
   changed: (rate_value c17) from 3 to 4
   goals met: 11 of 20
5. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 11 of 20
6. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 11 of 20
7. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 11 of 20
8. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 11 of 20
9. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 11 of 20
10. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 11 of 20
11. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 11 of 20
12. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 11 of 20
13. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 11 of 20
14. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 11 of 20
15. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 11 of 20
16. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 11 of 20
17. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 11 of 20
18. (increase_rate c17)
   changed: (rate_value c17) from 4 to 5
   goals met: 11 of 20
19. (increase_rate c17)
   changed: (rate_value c17) from 5 to 6
   goals met: 11 of 20
20. (increment c17)
   changed: (value c17) from 19 to 25
   goals met: 11 of 20
21. (increment c17)
   changed: (value c17) from 25 to 31
   goals met: 11 of 20
22. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 11 of 20
23. (increase_rate c16)
   changed: (rate_value c16) from 1 to 2
   goals met: 11 of 20
24. (increment c17)
   changed: (value c17) from 31 to 37
   goals met: 11 of 20
25. (increment c17)
   changed: (value c17) from 37 to 43
   goals met: 11 of 20
26. (increment c17)
   changed: (value c17) from 43 to 49
   goals met: 11 of 20
27. (increment c17)
   changed: (value c17) from 49 to 55
   goals met: 12 of 20
28. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 12 of 20
29. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 12 of 20
30. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 12 of 20
31. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 12 of 20
32. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 12 of 20
33. (increase_rate c14)
   changed: (rate_value c14) from 5 to 6
   goals met: 12 of 20
34. (increment c14)
   changed: (value c14) from 16 to 22
   goals met: 12 of 20
35. (increment c14)
   changed: (value c14) from 22 to 28
   goals met: 11 of 20
36. (increment c14)
   changed: (value c14) from 28 to 34
   goals met: 11 of 20
37. (increase_rate c14)
   changed: (rate_value c14) from 6 to 7
   goals met: 11 of 20
38. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 11 of 20
39. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 11 of 20
40. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 11 of 20
41. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 11 of 20
42. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 11 of 20
43. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 11 of 20
44. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 11 of 20
45. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 11 of 20
46. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 11 of 20
47. (increase_rate c13)
   changed: (rate_value c13) from 6 to 7
   goals met: 11 of 20
48. (decrement c14)
   changed: (value c14) from 34 to 27
   goals met: 12 of 20
49. (increase_rate c13)
   changed: (rate_value c13) from 7 to 8
   goals met: 12 of 20
50. (increment c13)
   changed: (value c13) from 40 to 48
   goals met: 12 of 20
51. (increment c14)
   changed: (value c14) from 27 to 34
   goals met: 11 of 20
52. (increment c13)
   changed: (value c13) from 48 to 56
   goals met: 11 of 20
53. (increment c13)
   changed: (value c13) from 56 to 64
   goals met: 11 of 20
54. (increase_rate c13)
   changed: (rate_value c13) from 8 to 9
   goals met: 11 of 20
55. (increase_rate c13)
   changed: (rate_value c13) from 9 to 10
   goals met: 11 of 20
56. (increase_rate c14)
   changed: (rate_value c14) from 7 to 8
   goals met: 11 of 20
57. (increase_rate c14)
   changed: (rate_value c14) from 8 to 9
   goals met: 11 of 20
58. (increase_rate c14)
   changed: (rate_value c14) from 9 to 10
   goals met: 11 of 20
59. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 11 of 20
60. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 11 of 20
61. (decrement c12)
   changed: (value c12) from 83 to 78
   goals met: 11 of 20
62. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 11 of 20
63. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 11 of 20
64. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 11 of 20
65. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 11 of 20
66. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 11 of 20
67. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 11 of 20
68. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 11 of 20
69. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 11 of 20
70. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 11 of 20
71. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 11 of 20
72. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 11 of 20
73. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 11 of 20
74. (increment c7)
   changed: (value c7) from 9 to 16
   goals met: 11 of 20
75. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 11 of 20
76. (increment c7)
   changed: (value c7) from 16 to 24
   goals met: 11 of 20
77. (increment c7)
   changed: (value c7) from 24 to 32
   goals met: 11 of 20
78. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 11 of 20
79. (increment c7)
   changed: (value c7) from 32 to 41
   goals met: 11 of 20
80. (increment c7)
   changed: (value c7) from 41 to 50
   goals met: 11 of 20
81. (increment c7)
   changed: (value c7) from 50 to 59
   goals met: 10 of 20
82. (increment c7)
   changed: (value c7) from 59 to 68
   goals met: 10 of 20
83. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 10 of 20
84. (increment c7)
   changed: (value c7) from 68 to 78
   goals met: 10 of 20
85. (decrement c6)
   changed: (value c6) from 95 to 90
   goals met: 10 of 20
86. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 10 of 20
87. (increment c4)
   changed: (value c4) from 7 to 14
   goals met: 10 of 20
88. (increment c4)
   changed: (value c4) from 14 to 21
   goals met: 10 of 20
89. (increment c4)
   changed: (value c4) from 21 to 28
   goals met: 10 of 20
90. (increment c4)
   changed: (value c4) from 28 to 35
   goals met: 10 of 20
91. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 10 of 20
92. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 10 of 20
93. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 10 of 20
94. (increment c4)
   changed: (value c4) from 35 to 43
   goals met: 9 of 20
95. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 9 of 20
96. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 9 of 20
97. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 9 of 20
98. (decrement c4)
   changed: (value c4) from 43 to 33
   goals met: 10 of 20
99. (decrement c3)
   changed: (value c3) from 62 to 59
   goals met: 10 of 20
100. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 10 of 20
101. (increment c4)
   changed: (value c4) from 33 to 43
   goals met: 9 of 20
102. (decrement c3)
   changed: (value c3) from 59 to 55
   goals met: 9 of 20
103. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 9 of 20
104. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 9 of 20
105. (increment c2)
   changed: (value c2) from 9 to 18
   goals met: 9 of 20
106. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 9 of 20
107. (increment c2)
   changed: (value c2) from 18 to 28
   goals met: 9 of 20
108. (increment c2)
   changed: (value c2) from 28 to 38
   goals met: 9 of 20
109. (increment c2)
   changed: (value c2) from 38 to 48
   goals met: 9 of 20
110. (increment c2)
   changed: (value c2) from 48 to 58
   goals met: 8 of 20
111. (increment c2)
   changed: (value c2) from 58 to 68
   goals met: 8 of 20
112. (decrement c12)
   changed: (value c12) from 78 to 73
   goals met: 8 of 20
113. (decrement c12)
   changed: (value c12) from 73 to 68
   goals met: 8 of 20
114. (decrement c12)
   changed: (value c12) from 68 to 63
   goals met: 9 of 20
115. (decrement c7)
   changed: (value c7) from 78 to 68
   goals met: 9 of 20
116. (decrement c6)
   changed: (value c6) from 90 to 85
   goals met: 9 of 20
117. (decrement c6)
   changed: (value c6) from 85 to 80
   goals met: 9 of 20
118. (decrement c7)
   changed: (value c7) from 68 to 58
   goals met: 10 of 20
119. (decrement c6)
   changed: (value c6) from 80 to 75
   goals met: 10 of 20
120. (decrement c6)
   changed: (value c6) from 75 to 70
   goals met: 10 of 20
121. (increment c7)
   changed: (value c7) from 58 to 68
   goals met: 9 of 20
122. (decrement c6)
   changed: (value c6) from 70 to 65
   goals met: 10 of 20
123. (decrement c7)
   changed: (value c7) from 68 to 58
   goals met: 10 of 20
124. (decrement c6)
   changed: (value c6) from 65 to 60
   goals met: 10 of 20
125. (decrement c6)
   changed: (value c6) from 60 to 55
   goals met: 11 of 20
126. (increase_rate c20)
   changed: (rate_value c20) from 0 to 1
   goals met: 11 of 20
127. (increase_rate c20)
   changed: (rate_value c20) from 1 to 2
   goals met: 11 of 20
128. (increase_rate c20)
   changed: (rate_value c20) from 2 to 3
   goals met: 11 of 20
129. (increase_rate c20)
   changed: (rate_value c20) from 3 to 4
   goals met: 11 of 20
130. (increase_rate c20)
   changed: (rate_value c20) from 4 to 5
   goals met: 11 of 20
131. (increment c20)
   changed: (value c20) from 47 to 52
   goals met: 11 of 20
132. (increment c20)
   changed: (value c20) from 52 to 57
   goals met: 11 of 20
133. (increase_rate c19)
   changed: (rate_value c19) from 0 to 1
   goals met: 11 of 20
134. (increase_rate c19)
   changed: (rate_value c19) from 1 to 2
   goals met: 11 of 20
135. (increase_rate c20)
   changed: (rate_value c20) from 5 to 6
   goals met: 11 of 20
136. (increment c20)
   changed: (value c20) from 57 to 63
   goals met: 11 of 20
137. (increase_rate c20)
   changed: (rate_value c20) from 6 to 7
   goals met: 11 of 20
138. (increment c20)
   changed: (value c20) from 63 to 70
   goals met: 11 of 20
139. (increment c20)
   changed: (value c20) from 70 to 77
   goals met: 11 of 20
140. (increment c20)
   changed: (value c20) from 77 to 84
   goals met: 12 of 20
141. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 12 of 20
142. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 12 of 20
143. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 12 of 20
144. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 12 of 20
145. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 12 of 20
146. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 12 of 20
147. (increment c11)
   changed: (value c11) from 46 to 52
   goals met: 12 of 20
148. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 12 of 20
149. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 12 of 20
150. (increment c11)
   changed: (value c11) from 52 to 58
   goals met: 12 of 20
151. (increment c11)
   changed: (value c11) from 58 to 64
   goals met: 11 of 20
152. (increment c11)
   changed: (value c11) from 64 to 70
   goals met: 11 of 20
153. (decrement c10)
   changed: (value c10) from 75 to 73
   goals met: 11 of 20
154. (decrement c10)
   changed: (value c10) from 73 to 71
   goals met: 11 of 20
155. (decrement c10)
   changed: (value c10) from 71 to 69
   goals met: 12 of 20
156. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 12 of 20
157. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 12 of 20
158. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 12 of 20
159. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 12 of 20
160. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 12 of 20
161. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 12 of 20
162. (increment c9)
   changed: (value c9) from 29 to 35
   goals met: 12 of 20
163. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 12 of 20
164. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 12 of 20
165. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 12 of 20
166. (increment c9)
   changed: (value c9) from 35 to 42
   goals met: 12 of 20
167. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 12 of 20
168. (increment c9)
   changed: (value c9) from 42 to 50
   goals met: 12 of 20
169. (increment c9)
   changed: (value c9) from 50 to 58
   goals met: 12 of 20
170. (increment c9)
   changed: (value c9) from 58 to 66
   goals met: 13 of 20
171. (increment c2)
   changed: (value c2) from 68 to 78
   goals met: 13 of 20
172. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 13 of 20
173. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 13 of 20
174. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 13 of 20
175. (increment c2)
   changed: (value c2) from 78 to 88
   goals met: 14 of 20
176. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 14 of 20
177. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 14 of 20
178. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 14 of 20
179. (increment c14)
   changed: (value c14) from 34 to 44
   goals met: 14 of 20
180. (increment c14)
   changed: (value c14) from 44 to 54
   goals met: 14 of 20
181. (decrement_rate c14)
   changed: (rate_value c14) from 10 to 9
   goals met: 14 of 20
182. (decrement c14)
   changed: (value c14) from 54 to 45
   goals met: 14 of 20
183. (increase_rate c14)
   changed: (rate_value c14) from 9 to 10
   goals met: 14 of 20
184. (decrement c14)
   changed: (value c14) from 45 to 35
   goals met: 14 of 20
185. (increment c12)
   changed: (value c12) from 63 to 68
   goals met: 13 of 20
186. (increment c13)
   changed: (value c13) from 64 to 74
   goals met: 14 of 20
187. (increment c12)
   changed: (value c12) from 68 to 73
   goals met: 15 of 20
188. (increment c4)
   changed: (value c4) from 43 to 53
   goals met: 15 of 20
189. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 15 of 20
190. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 15 of 20
191. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 15 of 20
192. (increment c5)
   changed: (value c5) from 38 to 41
   goals met: 15 of 20
193. (increment c5)
   changed: (value c5) from 41 to 44
   goals met: 15 of 20
194. (decrement c4)
   changed: (value c4) from 53 to 43
   goals met: 16 of 20
195. (increment c14)
   changed: (value c14) from 35 to 45
   goals met: 16 of 20
196. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 16 of 20
197. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 16 of 20
198. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 16 of 20
199. (increase_rate c15)
   changed: (rate_value c15) from 3 to 4
   goals met: 16 of 20
200. (increment c15)
   changed: (value c15) from 28 to 32
   goals met: 16 of 20
201. (increment c15)
   changed: (value c15) from 32 to 36
   goals met: 16 of 20
202. (decrement c14)
   changed: (value c14) from 45 to 35
   goals met: 17 of 20
203. (decrement c3)
   changed: (value c3) from 55 to 45
   goals met: 17 of 20
204. (decrement c3)
   changed: (value c3) from 45 to 35
   goals met: 18 of 20
205. (decrement c2)
   changed: (value c2) from 88 to 78
   goals met: 17 of 20
206. (decrement_rate c3)
   changed: (rate_value c3) from 10 to 9
   goals met: 17 of 20
207. (increment c3)
   changed: (value c3) from 35 to 44
   goals met: 16 of 20
208. (increment c3)
   changed: (value c3) from 44 to 53
   goals met: 16 of 20
209. (increment c3)
   changed: (value c3) from 53 to 62
   goals met: 16 of 20
210. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 16 of 20
211. (increment c4)
   changed: (value c4) from 43 to 53
   goals met: 15 of 20
212. (increment c5)
   changed: (value c5) from 44 to 47
   goals met: 15 of 20
213. (increment c5)
   changed: (value c5) from 47 to 50
   goals met: 15 of 20
214. (increment c4)
   changed: (value c4) from 53 to 63
   goals met: 16 of 20
215. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 16 of 20
216. (increment c5)
   changed: (value c5) from 50 to 54
   goals met: 16 of 20
217. (increment c3)
   changed: (value c3) from 62 to 72
   goals met: 15 of 20
218. (increment c2)
   changed: (value c2) from 78 to 88
   goals met: 16 of 20
219. (decrement c4)
   changed: (value c4) from 63 to 53
   goals met: 17 of 20
220. (increment c14)
   changed: (value c14) from 35 to 45
   goals met: 16 of 20
221. (increment c15)
   changed: (value c15) from 36 to 40
   goals met: 16 of 20
222. (increment c15)
   changed: (value c15) from 40 to 44
   goals met: 16 of 20
223. (increment c15)
   changed: (value c15) from 44 to 48
   goals met: 17 of 20
224. (increment c14)
   changed: (value c14) from 45 to 55
   goals met: 16 of 20
225. (increment c15)
   changed: (value c15) from 48 to 52
   goals met: 16 of 20
226. (increment c15)
   changed: (value c15) from 52 to 56
   goals met: 16 of 20
227. (increment c16)
   changed: (value c16) from 54 to 56
   goals met: 15 of 20
228. (increment c17)
   changed: (value c17) from 55 to 61
   goals met: 15 of 20
229. (increment c16)
   changed: (value c16) from 56 to 58
   goals met: 16 of 20
230. (decrement c2)
   changed: (value c2) from 88 to 78
   goals met: 15 of 20
231. (decrement c2)
   changed: (value c2) from 78 to 68
   goals met: 16 of 20
232. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 16 of 20
233. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 16 of 20
234. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 16 of 20
235. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 16 of 20
236. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 16 of 20
237. (decrement c1)
   changed: (value c1) from 87 to 82
   goals met: 16 of 20
238. (decrement c1)
   changed: (value c1) from 82 to 77
   goals met: 16 of 20
239. (decrement c1)
   changed: (value c1) from 77 to 72
   goals met: 16 of 20
240. (decrement c1)
   changed: (value c1) from 72 to 67
   goals met: 17 of 20
241. (decrement c3)
   changed: (value c3) from 72 to 62
   goals met: 16 of 20
242. (decrement c3)
   changed: (value c3) from 62 to 52
   goals met: 17 of 20
243. (decrement c2)
   changed: (value c2) from 68 to 58
   goals met: 16 of 20
244. (decrement c2)
   changed: (value c2) from 58 to 48
   goals met: 17 of 20
245. (decrement c1)
   changed: (value c1) from 67 to 62
   goals met: 17 of 20
246. (decrement c1)
   changed: (value c1) from 62 to 57
   goals met: 17 of 20
247. (decrement c1)
   changed: (value c1) from 57 to 52
   goals met: 17 of 20
248. (decrement c1)
   changed: (value c1) from 52 to 47
   goals met: 18 of 20
249. (increment c14)
   changed: (value c14) from 55 to 65
   goals met: 17 of 20
250. (increment c15)
   changed: (value c15) from 56 to 60
   goals met: 16 of 20
251. (increment c16)
   changed: (value c16) from 58 to 60
   goals met: 16 of 20
252. (increment c16)
   changed: (value c16) from 60 to 62
   goals met: 16 of 20
253. (increment c17)
   changed: (value c17) from 61 to 67
   goals met: 17 of 20
254. (increase_rate c18)
   changed: (rate_value c18) from 0 to 1
   goals met: 17 of 20
255. (increase_rate c18)
   changed: (rate_value c18) from 1 to 2
   goals met: 17 of 20
256. (increase_rate c18)
   changed: (rate_value c18) from 2 to 3
   goals met: 17 of 20
257. (increment c18)
   changed: (value c18) from 59 to 62
   goals met: 17 of 20
258. (increment c18)
   changed: (value c18) from 62 to 65
   goals met: 17 of 20
259. (increment c18)
   changed: (value c18) from 65 to 68
   goals met: 18 of 20
260. (increment c15)
   changed: (value c15) from 60 to 64
   goals met: 17 of 20
261. (increment c15)
   changed: (value c15) from 64 to 68
   goals met: 18 of 20
262. (increase_rate c16)
   changed: (rate_value c16) from 2 to 3
   goals met: 18 of 20
263. (increment c16)
   changed: (value c16) from 62 to 65
   goals met: 18 of 20
264. (increment c16)
   changed: (value c16) from 65 to 68
   goals met: 17 of 20
265. (increment c17)
   changed: (value c17) from 67 to 73
   goals met: 17 of 20
266. (increment c18)
   changed: (value c18) from 68 to 71
   goals met: 17 of 20
267. (increment c18)
   changed: (value c18) from 71 to 74
   goals met: 18 of 20
268. (increment c16)
   changed: (value c16) from 68 to 71
   goals met: 19 of 20
269. (increment c14)
   changed: (value c14) from 65 to 75
   goals met: 19 of 20
270. (increment c15)
   changed: (value c15) from 68 to 72
   goals met: 18 of 20
271. (increment c16)
   changed: (value c16) from 71 to 74
   goals met: 18 of 20
272. (increment c17)
   changed: (value c17) from 73 to 79
   goals met: 18 of 20
273. (increment c18)
   changed: (value c18) from 74 to 77
   goals met: 18 of 20
274. (increment c18)
   changed: (value c18) from 77 to 80
   goals met: 18 of 20
275. (increment c19)
   changed: (value c19) from 78 to 80
   goals met: 18 of 20
276. (increment c19)
   changed: (value c19) from 80 to 82
   goals met: 19 of 20
277. (increment c15)
   changed: (value c15) from 72 to 76
   goals met: 19 of 20
278. (increment c16)
   changed: (value c16) from 74 to 77
   goals met: 20 of 20
